# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1, 0.25, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, RepHMS, [128, 2, 1, 3, 3]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, RepHMS, [256, 2, 1, 3, 5]]
  - [-1, 1, SCDown, [512, 3, 2]]
  - [-1, 1, RepHMS, [512, 2, 1, 3, 7]]
  - [-1, 1, SCDown, [768, 3, 2]]
  - [-1, 1, RepHMS, [768, 2, 1, 2.5, 9]]
  - [-1, 1, SPPF, [768, 5]]
  - [-1, 1, PSA, [768]]

head:
  - [6, 1, AVG, []]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 2, 1, 3, 9]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, AVG, []]
  - [[-1, 6, -2], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 2, 1, 3, 7]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, AVG, []]
  - [[-1, 4, -2], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 2, 1, 3, 5]]

  - [[-1, 18], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 2, 1, 3, 5]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [21, 1, AVG, []]
  - [[-2, -1, 17, 14], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 2, 1, 3, 7]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [17, 1, AVG, []]
  - [[-2, -1, 13], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 2, 1, 3, 9]]

  - [[23, 27, 31], 1, v10Detect, [nc]]
