# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
#  n: [0.33, 0.25, 1024]
  m: [1, 1, 768]
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [96, 3, 2]] # 1-P2/4
  - [-1, 1, RepHMS, [96, 3, 1, 3, 3]]
  - [-1, 1, Conv, [192, 3, 2]] # 3-P3/8
  - [-1, 1, RepHMS, [192, 4, 1, 2.5, 5]]
  - [-1, 1, SCDown, [384, 3, 2]] # 5-P4/16
  - [-1, 1, RepHMS, [384, 4, 1, 2.5, 7]]
  - [-1, 1, SCDown, [512, 3, 2]] # 7-P5/32
  - [-1, 1, RepHMS, [512, 3, 1, 2, 9]]
  - [-1, 1, SPPF, [512, 5]] # 9
  - [-1, 1, PSA, [512]] # 10

# YOLOv8.0n head
head:
  - [6, 1, AVG, []]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 3, 1, 2, 9]] #13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, AVG, []]
  - [[-1, 6, -2, -3], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 3, 1, 2.5, 7]] #18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, AVG, []]
  - [[-1, 4, -2, -3], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 3, 1, 3, 5]] #23

  - [18, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, -2], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 3, 1, 3, 5]] # 26

  - [-1, 1, Conv, [256, 3, 2]]
  - [23, 1, AVG, []]
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-2, -1, 18, -3], 1, Concat, [1]]
  - [-1, 1, RepHMS, [256, 3, 1, 2.5, 7]] # 31

  - [-1, 1, Conv, [256, 3, 2]]
  - [18, 1, AVG, []]
  - [[-2, -1, 13], 1, Concat, [1]]
  - [-1, 1, RepHMS, [384, 3, 1, 2, 9]] # 35

  - [[26, 31, 35], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
