# Parameters
nc: 1000 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  n: [1, 0.25, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, RepHMS, [128, 2, 1, 3, 3]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, RepHMS, [256, 2, 2, 3, 5]]
  - [-1, 1, SCDown, [512, 3, 2]]
  - [-1, 1, RepHMS, [512, 2, 2, 3, 7]]
  - [-1, 1, SCDown, [1024, 3, 2]]
  - [-1, 1, RepHMS, [1024, 2, 1, 3, 9]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, PSA, [1024]]

head:
  - [-1, 1, Classify, [nc]] # Classify
